In [2]:
# Importing required libraries

import pandas as pd
import numpy as np

In [3]:
# Creating dataset for practicing Pandas

data = {
    "OrderID": [
        1001, 1002, 1003, 1004, 1005,
        1006, 1007, 1008, 1009, 1010,
        1011, 1012, 1013, 1014, 1015,
        1016, 1017, 1018, 1019, 1020
    ],
    
    "Customer": [
        "Alice", "Bob", "Charlie", "Diana", "Emma",
        "Frank", "George", "Helen", "Ian", "Jenny",
        "Kyle", "Laura", "Mike", "Nina", "Oscar",
        "Paul", "Queen", "Rita", "Sam", "Tina"
    ],
    
    # Mixed date formats to test pd.to_datetime parsing
    "OrderDate": [
        "2023-01-05", "05/02/2023", "2023/03/12", "12-04-2023", "2023-05-01",
        "2023-06-15", "15/07/2023", "2023/08/20", "20-09-2023", "2023-10-11",
        "2023-11-01", "01/12/2023", "2024/01/05", "05-02-2024", "2024-03-15",
        "2024-04-18", "18/05/2024", "2024/06/22", "22-07-2024", None
    ],
    
    # Category column for grouping, value_counts, plots
    "Category": [
        "A", "B", "A", "C", "B",
        "A", "C", "B", "C", "A",
        "B", "C", "A", "B", "C",
        "A", "A", "C", "B", "C"
    ],
    
    # Price as string with commas for cleaning exercises
    "UnitPrice": [
        "1,200.50", "500", "750.25", "1,000", "650.00",
        "900", "1,500", "450", "1,050.75", "800",
        "999.99", "1,700", "880.40", "1,250", "600",
        "1,300", "550", "700", "1,450", "1,100"
    ],
    
    # Quantity column for numeric operations
    "Quantity": [
        2, 1, 3, 5, 2,
        4, 1, 2, 3, 5,
        2, 4, 3, 1, 2,
        5, 6, 1, 2, 3
    ],
    
    # Email column for string functions: .str.split, .str.contains, .str.lower, etc.
    "Email": [
        "alice@example.com", "bob@mail.com", "charlie@example.com", "diana@mail.com", "emma@example.com",
        "frank@mail.com", "george@example.com", "helen@mail.com", "ian@mail.com", "jenny@example.com",
        "kyle@mail.com", "laura@example.com", "mike@mail.com", "nina@example.com", "oscar@mail.com",
        "paul@example.com", "queen@mail.com", "rita@example.com", "sam@mail.com", "tina@example.com"
    ],
    
    # Status column for filtering, replace(), category analysis
    "Status": [
        "Delivered", "Pending", "Delivered", "Returned", "Delivered",
        "Pending", "Delivered", "Pending", "Delivered", "Delivered",
        "Returned", "Pending", "Delivered", "Pending", "Delivered",
        "Delivered", "Pending", "Returned", "Pending", "Delivered"
    ],
    
    # Float column with some NaN values for mean(), fillna(), interpolate()
    "Rating": [
        4.5, 3.8, None, 4.2, 5.0,
        None, 3.5, 4.8, 4.0, None,
        3.9, 4.4, None, 5.0, 4.7,
        4.1, None, 3.6, 4.9, 4.3
    ],
    
    # Random sales numbers for sorting, plotting, stats
    "Sales": [
        2400, 500, 2250, 5000, 1300,
        3600, 1500, 900, 3150, 4000,
        1999, 6800, 2641, 1250, 2800,
        3900, 3300, 700, 2900, 2200
    ],
}

### A

In [6]:
df = pd.DataFrame(data)
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [7]:
df.tail()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
15,1016,Paul,2024-04-18,A,"1,300",5,paul@example.com,Delivered,4.1,3900
16,1017,Queen,18/05/2024,A,550,6,queen@mail.com,Pending,NaN,3300
17,1018,Rita,2024/06/22,C,700,1,rita@example.com,Returned,3.6,700
18,1019,Sam,22-07-2024,B,"1,450",2,sam@mail.com,Pending,4.9,2900
19,1020,Tina,None,C,"1,100",3,tina@example.com,Delivered,4.3,2200

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderID    20 non-null     int64
 1   Customer   20 non-null     object
 2   OrderDate  19 non-null     object
 3   Category   20 non-null     object
 4   UnitPrice  20 non-null     object
 5   Quantity   20 non-null     int64
 6   Email      20 non-null     object
 7   Status     20 non-null     object
 8   Rating     15 non-null     float64
 9   Sales      20 non-null     int64
dtypes: float64(1), int64(3), object(6)
memory usage: 1.7+ KB

In [9]:
df.describe()

          OrderID   Quantity     Rating        Sales
count    20.00000  20.000000  15.000000    20.000000
mean   1010.50000   2.850000   4.313333  2654.500000
std       5.91608   1.531253   0.498378  1542.912096
min    1001.00000   1.000000   3.500000   500.000000
25%    1005.75000   2.000000   3.950000  1450.000000
50%    1010.50000   2.500000   4.300000  2520.500000
75%    1015.25000   4.000000   4.750000  3375.000000
max    1020.00000   6.000000   5.000000  6800.000000

In [18]:
print(df.shape)
print()

print(df.columns)
print()

print(df.index)
print()

print(df.dtypes)
print()

(20, 10)

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

RangeIndex(start=0, stop=20, step=1)

OrderID        int64
Customer      object
OrderDate     object
Category      object
UnitPrice     object
Quantity       int64
Email         object
Status        object
Rating       float64
Sales          int64
dtype: object

In [24]:
print(df['OrderID'])
print()
print(df[['OrderID', 'Sales']])

0     1001
1     1002
2     1003
3     1004
4     1005
5     1006
6     1007
7     1008
8     1009
9     1010
10    1011
11    1012
12    1013
13    1014
14    1015
15    1016
16    1017
17    1018
18    1019
19    1020
Name: OrderID, dtype: int64

    OrderID  Sales
0      1001   2400
1      1002    500
2      1003   2250
3      1004   5000
4      1005   1300
5      1006   3600
6      1007   1500
7      1008    900
8      1009   3150
9      1010   4000
10     1011   1999
11     1012   6800
12     1013   2641
13     1014   1250
14     1015   2800
15     1016   3900
16     1017   3300
17     1018    700
18     1019   2900
19     1020   2200

In [46]:
print(df.iloc[0])

OrderID                   1001
Customer                 Alice
OrderDate           2023-01-05
Category                     A
UnitPrice             1,200.50
Quantity                     2
Email        alice@example.com
Status               Delivered
Rating                     4.5
Sales                     2400
Name: 0, dtype: object

In [49]:
print(df[df['Rating']>4.8])

    OrderID Customer   OrderDate Category UnitPrice  Quantity  \
4      1005     Emma  2023-05-01        B    650.00         2
13     1014     Nina  05-02-2024        B     1,250         1
18     1019      Sam  22-07-2024        B     1,450         2

               Email     Status  Rating  Sales
4   emma@example.com  Delivered     5.0   1300
13  nina@example.com    Pending     5.0   1250
18      sam@mail.com    Pending     4.9   2900

In [53]:
df.columns

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

In [65]:
df['Category'].value_counts()

Category
A    7
C    7
B    6
Name: count, dtype: int64

In [66]:
df[['Category', 'Status']].value_counts()

Category  Status
A         Delivered    5
B         Pending      4
C         Delivered    4
A         Pending      2
C         Returned     2
B         Delivered    1
          Returned     1
C         Pending      1
Name: count, dtype: int64

In [62]:
df['UnitPrice'].sort_values()

3        1,000
8     1,050.75
19       1,100
0     1,200.50
13       1,250
15       1,300
18       1,450
6        1,500
11       1,700
7          450
1          500
16         550
14         600
4       650.00
17         700
2       750.25
9          800
12      880.40
5          900
10      999.99
Name: UnitPrice, dtype: object

In [ ]:
df.rename(columns={'Status': 'Status'})

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300
5,1006,Frank,2023-06-15,A,900,4,frank@mail.com,Pending,NaN,3600
6,1007,George,15/07/2023,C,"1,500",1,george@example.com,Delivered,3.5,1500
7,1008,Helen,2023/08/20,B,450,2,helen@mail.com,Pending,4.8,900
8,1009,Ian,20-09-2023,C,"1,050.75",3,ian@mail.com,Delivered,4.0,3150
9,1010,Jenny,2023-10-11,A,800,5,jenny@example.com,Delivered,NaN,4000
10,1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999
11,1012,Laura,01/12/2023,C,"1,700",4,laura@example.com,Pending,4.4,6800
12,1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641
13,1014,Nina,05-02-2024,B,"1,250",1,nina@example.com,Pending,5.0,1250
14,1015,Oscar,2024-03-15,C,600,2,oscar@mail.com,Delivered,4.7,2800
15,1016,Paul,2024-04-18,A,"1,300",5,paul@example.com,Delivered,4.1,3900
16,1017,Queen,18/05/2024,A,550,6,queen@mail.com,Pending,NaN,3300
17,1018,Rita,2024/06/22,C,700,1,rita@example.com,Returned,3.6,700
18,1019,Sam,22-07-2024,B,"1,450",2,sam@mail.com,Pending,4.9,2900
19,1020,Tina,None,C,"1,100",3,tina@example.com,Delivered,4.3,2200

====================================================================

### B

In [75]:
df.columns

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

In [80]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [ ]:
Common binary operations